sample_subscription_message_for_curl.xml

<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\" ?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wsnt=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:ns6=\"http://docs.oasis-open.org/wsn/t-1\" xmlns:ns7=\"http://docs.oasis-open.org/wsn/br-2\" xmlns:ns9=\"http://docs.oasis-open.org/wsrf/r-2\"><s:Header><wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest</wsa:Action></s:Header><s:Body><wsnt:Subscribe><wsnt:ConsumerReference><wsa:Address>http://127.0.0.1/DerpConsumer</wsa:Address></wsnt:ConsumerReference><wsnt:Filter><wsnt:TopicExpression Dialect=\"http://docs.oasis-open.org/wsn/t-1/TopicExpression/Simple\">DerpTopic</wsnt:TopicExpression><wsnt:MessageContent><data>someData</data></wsnt:MessageContent></wsnt:Filter></wsnt:Subscribe></s:Body></s:Envelope>